weir/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          88;
        startFace       40282;
    }
    outlet
    {
        type            patch;
        nFaces          128;
        startFace       40370;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          310;
        startFace       40498;
    }
    atmosphere
    {
        type            patch;
        nFaces          190;
        startFace       40808;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40640;
        startFace       40998;
    }
)

// ************************************************************************* //
